'''
Задание:
Написать модуль с функциями суммы, вычитания, умножения, деления.

В основном файле создать консольную программу калькулятор и воспользоваться для расчета функциями из модуля.
'''

'''
    Для работы с функциями пропишите команду print(Calculator.Rules.__doc__), для этого нужно импортировать директорию
'''
import Calculator.Arithmetic as A

print(A.div(500,2))



