'''
Написать программу, запрашивающую на ввод год рождения, которая рассчитывает возраст пользователя.
'''
##print('Введите год рождения: ')
##a = int(input())
##if a > 1900:
##    print('Ваш возраст:',a - 1900,'лет')

print('Введите год рождения: ')
a = int(input())
print('Ваш возраст:', 2022 - a)
